# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

def add_bread():
    print('Возьмём булочки')

def add_kotletka():
    print("Добавим котлетку")

def add_cucumber():
    print('Нарежем огурчик')

def add_tomato():
    print('Положим томат')

def add_mayones():
    print('Конечно же мазик')

def add_cheese():
    print('Натрём сыр')

def add_onionrings():
    print('Положим лук, нарезанный тонкими колечками')